function containAllRots(strng, arr) {
    for (var i = 0; i < strng.length; i++)
        if (arr.indexOf(strng.slice(i) + strng.slice(0, i)) === -1) {
            return false;
        }
    return true;
}

// У тілі циклу перевіряється, чи містить масив arr кожен можливий повернутий варіант рядка strng. 
// Метод .slice() використовується для отримання частини рядка strng, починаючи з поточного індексу i до кінця рядка strng. Наступний виклик .slice(0, i) повертає частину рядка strng, починаючи з початку і закінчуючи перед поточним індексом i.

// Метод .indexOf() використовується для пошуку цього об'єднаного рядка в масиві arr. Якщо об'єднаний рядок не знайдений у масиві (indexOf === -1), це означає, що не всі можливі повороти strng містяться у масиві arr, тому функція повертає false.